# Panda-2D :Data Frame

In [6]:
import pandas as pd

In [10]:
subway_df = pd.read_csv('nyc_subway_weather.csv')

In [11]:
subway_df.head()

,UNIT,DATEn,TIMEn,ENTRIESn,EXITSn,ENTRIESn_hourly,EXITSn_hourly,datetime,hour,day_week,...,pressurei,rain,tempi,wspdi,meanprecipi,meanpressurei,meantempi,meanwspdi,weather_lat,weather_lon
0,R003,05-01-11,00:00:00,4388333,2911002,0.0,0.0,2011-05-01 00:00:00,0,6,...,30.22,0,55.9,3.5,0.0,30.258,55.98,7.86,40.700348,-73.887177
1,R003,05-01-11,04:00:00,4388333,2911002,0.0,0.0,2011-05-01 04:00:00,4,6,...,30.25,0,52.0,3.5,0.0,30.258,55.98,7.86,40.700348,-73.887177
2,R003,05-01-11,12:00:00,4388333,2911002,0.0,0.0,2011-05-01 12:00:00,12,6,...,30.28,0,62.1,6.9,0.0,30.258,55.98,7.86,40.700348,-73.887177
3,R003,05-01-11,16:00:00,4388333,2911002,0.0,0.0,2011-05-01 16:00:00,16,6,...,30.26,0,57.9,15.0,0.0,30.258,55.98,7.86,40.700348,-73.887177
4,R003,05-01-11,20:00:00,4388333,2911002,0.0,0.0,2011-05-01 20:00:00,20,6,...,30.28,0,52.0,10.4,0.0,30.258,55.98,7.86,40.700348,-73.887177

## Calculating correlation

In [16]:
rain = subway_df['meanprecipi']
temp = subway_df['meantempi']
cum_entries = subway_df['ENTRIESn_hourly']
entries = subway_df['ENTRIESn']

In [14]:
def correlation(x,y):
    std_x = (x - x.mean())/x.std(ddof = 0)
    std_y = (y - y.mean())/y.std(ddof = 0)
    return (std_x * std_y).mean()

In [15]:
correlation(rain,temp)

-0.22903432340833663

In [17]:
correlation(cum_entries, entries)

0.5858954707662182


# Vectorized operations

Similar to vectorized operation for 2D- Numpy Array
<br>
Match up elements by **index or column name** rather position.

1. Adding dataframes with column names

In [19]:
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df2 = pd.DataFrame({'a': [10, 20, 30], 'b': [40, 50, 60], 'c': [70, 80, 90]})

In [20]:
print(df1)
print(df2)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
    a   b   c
0  10  40  70
1  20  50  80
2  30  60  90

In [21]:
df1 + df2

    a   b   c
0  11  44  77
1  22  55  88
2  33  66  99

2. Adding DataFrames with overlapping column names

In [22]:
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df2 = pd.DataFrame({'d': [10, 20, 30], 'c': [40, 50, 60], 'b': [70, 80, 90]})

In [23]:
print(df1)
print(df2)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
    d   c   b
0  10  40  70
1  20  50  80
2  30  60  90

In [24]:
df1 + df2

    a   b   c   d
0 NaN  74  47 NaN
1 NaN  85  58 NaN
2 NaN  96  69 NaN

3. Adding Dataframes with overlapping row indexes

In [25]:
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]},
                       index=['row1', 'row2', 'row3'])
df2 = pd.DataFrame({'a': [10, 20, 30], 'b': [40, 50, 60], 'c': [70, 80, 90]},
                       index=['row4', 'row3', 'row2'])

In [26]:
print(df1)
print(df2)

      a  b  c
row1  1  4  7
row2  2  5  8
row3  3  6  9
       a   b   c
row4  10  40  70
row3  20  50  80
row2  30  60  90

In [27]:
df1 + df2

         a     b     c
row1   NaN   NaN   NaN
row2  32.0  65.0  98.0
row3  23.0  56.0  89.0
row4   NaN   NaN   NaN

In [30]:
df1 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                       index=['row1', 'row2', 'row3'])
df2 = pd.DataFrame([[10, 20, 30],[0, 50, 60], [70, 80, 90]],
                       index=['row4', 'row3', 'row2'])

In [31]:
print(df1)
print(df2)

      0  1  2
row1  1  2  3
row2  4  5  6
row3  7  8  9
       0   1   2
row4  10  20  30
row3   0  50  60
row2  70  80  90

In [32]:
df1 + df2

         0     1     2
row1   NaN   NaN   NaN
row2  74.0  85.0  96.0
row3   7.0  58.0  69.0
row4   NaN   NaN   NaN

In [33]:
df1 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df2 = pd.DataFrame([[10, 20, 30],[0, 50, 60], [70, 80, 90]])

In [34]:
df1 + df2

    0   1   2
0  11  22  33
1   4  55  66
2  77  88  99

Fill in this function to take a DataFrame with cumulative entries
    and exits (entries in the first column, exits in the second) and
    return a DataFrame with hourly entries and exits (entries in the
    first column, exits in the second)

In [35]:
entries_and_exits = pd.DataFrame({
    'ENTRIESn': [3144312, 3144335, 3144353, 3144424, 3144594,
                 3144808, 3144895, 3144905, 3144941, 3145094],
    'EXITSn': [1088151, 1088159, 1088177, 1088231, 1088275,
               1088317, 1088328, 1088331, 1088420, 1088753]
})

In [36]:
print(entries_and_exits)

   ENTRIESn   EXITSn
0   3144312  1088151
1   3144335  1088159
2   3144353  1088177
3   3144424  1088231
4   3144594  1088275
5   3144808  1088317
6   3144895  1088328
7   3144905  1088331
8   3144941  1088420
9   3145094  1088753

In [37]:
entries_and_exits.shift()

    ENTRIESn     EXITSn
0        NaN        NaN
1  3144312.0  1088151.0
2  3144335.0  1088159.0
3  3144353.0  1088177.0
4  3144424.0  1088231.0
5  3144594.0  1088275.0
6  3144808.0  1088317.0
7  3144895.0  1088328.0
8  3144905.0  1088331.0
9  3144941.0  1088420.0

In [38]:
def get_hourly_entries_and_exits(entries_and_exits):
    return entries_and_exits - entries_and_exits.shift()

In [39]:
print(get_hourly_entries_and_exits(entries_and_exits))

   ENTRIESn  EXITSn
0       NaN     NaN
1      23.0     8.0
2      18.0    18.0
3      71.0    54.0
4     170.0    44.0
5     214.0    42.0
6      87.0    11.0
7      10.0     3.0
8      36.0    89.0
9     153.0   333.0

# Adding DataFrame with Series

*Index of series match with column of DataFrame*

## Adding use '+'

Adding series to square DataFrame

In [4]:
import pandas as pd

s= pd.Series([1,2,3,4])
df = pd.DataFrame({
    0: [10, 20, 30, 40],
    1: [50, 60, 70, 80],
    2: [90, 100, 110, 120],
    3: [130, 140, 150, 160]
})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    0   1    2    3
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [5]:
df + s

    0   1    2    3
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

Adding series to one-row dataFrame

In [6]:
s = pd.Series([1,2,3,4])
df = pd.DataFrame({0: [10], 1: [20], 2: [30], 3: [40]})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    0   1   2   3
0  10  20  30  40

In [7]:
df + s

    0   1   2   3
0  11  22  33  44

Adding series to one-column DataFrame

In [9]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({0: [10, 20, 30, 40]})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    0
0  10
1  20
2  30
3  40

In [10]:
df + s

    0   1   2   3
0  11 NaN NaN NaN
1  21 NaN NaN NaN
2  31 NaN NaN NaN
3  41 NaN NaN NaN

Adding DataFrame column names match Series Index

In [11]:
s = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
df = pd.DataFrame({
    'a': [10, 20, 30, 40],
    'b': [50, 60, 70, 80],
    'c': [90, 100, 110, 120],
     'd': [130, 140, 150, 160]
})
print(s)
print(df)

a    1
b    2
c    3
d    4
dtype: int64
    a   b    c    d
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [12]:
df + s

    a   b    c    d
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

Adding when DataFrame column names don't match Series index

In [13]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({
        'a': [10, 20, 30, 40],
        'b': [50, 60, 70, 80],
        'c': [90, 100, 110, 120],
        'd': [130, 140, 150, 160]
})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    a   b    c    d
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [14]:
df + s

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

OTHER EXAMPLES

In [16]:
s = pd.Series([1,2,3,4])
df = pd.DataFrame({
    0: [10, 20, 30, 40],
    1: [50, 60, 70, 80],
    2: [90, 100, 110, 120],
    3: [130, 140, 150, 160]
})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    0   1    2    3
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [17]:
df + s

    0   1    2    3
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

## Adding using "add" method and axis

In [18]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({
    0: [10, 20, 30, 40],
    1: [50, 60, 70, 80],
    2: [90, 100, 110, 120],
    3: [130, 140, 150, 160]
})
print(s)
print(df)

0    1
1    2
2    3
3    4
dtype: int64
    0   1    2    3
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [27]:
df + s

    0   1    2    3
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

In [24]:
df.add(s , axis = 'columns')

    0   1    2    3
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

In [29]:
df.add(s , axis = 1)

    0   1    2    3
0  11  52   93  134
1  21  62  103  144
2  31  72  113  154
3  41  82  123  164

In [20]:
df.add(s, axis = 'index')

    0   1    2    3
0  11  51   91  131
1  22  62  102  142
2  33  73  113  153
3  44  84  124  164

In [26]:
df.add(s,axis = 0)

    0   1    2    3
0  11  51   91  131
1  22  62  102  142
2  33  73  113  153
3  44  84  124  164